ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/TARGET_PIC32CXMTG_EK/PeripheralPins.c
// MBED_WEAK const PinMap PinMap_SPI_CLK[] = {
// #ifdef USART0_BASE
    // /* USART0 */
    // {PA0,  SPI_0, 30},
    // {PA1,  SPI_0, 31},
    // {PA2,  SPI_0,  0},
    // {PA3,  SPI_0,  1},
    // {PA4,  SPI_0,  2},
    // {PA5,  SPI_0,  3},
    // {PB11, SPI_0,  4},
    // {PB12, SPI_0,  5},
    // {PB13, SPI_0,  6},
    // {PB14, SPI_0,  7},
    // {PB15, SPI_0,  8},
    // {PD9,  SPI_0, 15},
    // {PD10, SPI_0, 16},
    // {PD11, SPI_0, 17},
    // {PD12, SPI_0, 18},
    // {PD13, SPI_0, 19},
    // {PD14, SPI_0, 20},
    // {PD15, SPI_0, 21},
// #endif
// #ifdef USART1_BASE
    // /* USART1 */
    // {PC6,  SPI_1,  9},
    // {PC7,  SPI_1, 10},
    // {PC8,  SPI_1, 11},
    // {PC9,  SPI_1, 12},
    // {PC10, SPI_1, 13},
    // {PC11, SPI_1, 14},
    // {PF0,  SPI_1, 22},
    // {PF1,  SPI_1, 23},
    // {PF2,  SPI_1, 24},
    // {PF3,  SPI_1, 25},
    // {PF4,  SPI_1, 26},
    // {PF5,  SPI_1, 27},
    // {PF6,  SPI_1, 28},
    // {PA0,  SPI_1, 30},
    // {PA1,  SPI_1, 31},
// #endif
// #ifdef USART2_BASE
    // /* USART2 */
    // {PA7,  SPI_2, 0},
    // {PA8,  SPI_2, 1},
    // {PA9,  SPI_2, 2},
    // {PI0,  SPI_2, 3},
    // {PI1,  SPI_2, 4},
    // {PI2,  SPI_2, 5},
    // {PI3,  SPI_2, 6},
    // {PB6,  SPI_2, 7},
    // {PB7,  SPI_2, 8},
    // {PB8,  SPI_2, 9},
    // {PB9,  SPI_2, 10},
    // {PB10, SPI_2, 11},
    // {PF7,  SPI_2, 18},
    // {PF8,  SPI_2, 19},
    // {PF9,  SPI_2, 20},
    // {PF10, SPI_2, 21},
    // {PF11, SPI_2, 22},
    // {PF12, SPI_2, 23},
    // {PF13, SPI_2, 24},
    // {PF14, SPI_2, 25},
    // {PF15, SPI_2, 26},
    // {PK0,  SPI_2, 27},
    // {PK1,  SPI_2, 28},
    // {PK2,  SPI_2, 29},
    // {PA6,  SPI_2, 31},
// #endif
// #ifdef USART3_BASE
    // /* USART3 */
    // {PJ14, SPI_3, 14},
    // {PJ15, SPI_3, 15},
    // {PC0,  SPI_3, 16},
    // {PC1,  SPI_3, 17},
    // {PC2,  SPI_3, 18},
    // {PC3,  SPI_3, 19},
    // {PC4,  SPI_3, 20},
    // {PC5,  SPI_3, 21},
// #endif
    // {NC  , NC   , NC}
// };

// MBED_WEAK const PinMap PinMap_SPI_CS[] = {
// #ifdef USART0_BASE
    // /* USART0 */
    // {PA0,  SPI_0,  29},
    // {PA1,  SPI_0,  30},
    // {PA2,  SPI_0,  31},
    // {PA3,  SPI_0,  0},
    // {PA4,  SPI_0,  1},
    // {PA5,  SPI_0,  2},
    // {PB11, SPI_0,  3},
    // {PB12, SPI_0,  4},
    // {PB13, SPI_0,  5},
    // {PB14, SPI_0,  6},
    // {PB15, SPI_0,  7},
    // {PD9,  SPI_0, 14},
    // {PD10, SPI_0, 15},
    // {PD11, SPI_0, 16},
    // {PD12, SPI_0, 17},
    // {PD13, SPI_0, 18},
    // {PD14, SPI_0, 19},
    // {PD15, SPI_0, 20},
// #endif
// #ifdef USART1_BASE
    // /* USART1 */
    // {PC6,  SPI_1,  8},
    // {PC7,  SPI_1,  9},
    // {PC8,  SPI_1, 10},
    // {PC9,  SPI_1, 11},
    // {PC10, SPI_1, 12},
    // {PC11, SPI_1, 13},
    // {PF0,  SPI_1, 21},
    // {PF1,  SPI_1, 22},
    // {PF2,  SPI_1, 23},
    // {PF3,  SPI_1, 24},
    // {PF4,  SPI_1, 25},
    // {PF5,  SPI_1, 26},
    // {PF6,  SPI_1, 27},
// #endif
// #ifdef USART2_BASE
    // /* USART2 */
    // {PA8,  SPI_2, 0},
    // {PA9,  SPI_2, 1},
    // {PI0,  SPI_2, 2},
    // {PI1,  SPI_2, 3},
    // {PI2,  SPI_2, 4},
    // {PI3,  SPI_2, 5},
    // {PB6,  SPI_2, 6},
    // {PB7,  SPI_2, 7},
    // {PB8,  SPI_2, 8},
    // {PB9,  SPI_2, 9},
    // {PB10, SPI_2, 10},
    // {PF7,  SPI_2, 17},
    // {PF8,  SPI_2, 18},
    // {PF9,  SPI_2, 19},
    // {PF10, SPI_2, 20},
    // {PF11, SPI_2, 21},
    // {PF12, SPI_2, 22},
    // {PF13, SPI_2, 23},
    // {PF14, SPI_2, 24},
    // {PF15, SPI_2, 25},
    // {PK0,  SPI_2, 26},
    // {PK1,  SPI_2, 27},
    // {PK2,  SPI_2, 28},
    // {PA6,  SPI_2, 30},
    // {PA7,  SPI_2, 31},
// #endif
// #ifdef USART3_BASE
    // /* USART3 */
    // {PJ14, SPI_3, 13},
    // {PJ15, SPI_3, 14},
    // {PC0,  SPI_3, 15},
    // {PC1,  SPI_3, 16},
    // {PC2,  SPI_3, 17},
    // {PC3,  SPI_3, 18},
    // {PC4,  SPI_3, 19},
    // {PC5,  SPI_3, 20},
// #endif
    // {NC  , NC   , NC}
// };

/************UART**************/
MBED_WEAK const PinMap PinMap_UART_TX[] = {
    /* USART0 */
    {PIO_PA4_IDX, USART_0, IOPORT_MODE_MUX_A},
    /* USART1 */
    {PIO_PA8_IDX, USART_1, IOPORT_MODE_MUX_A},
    {PIO_PC2_IDX, USART_1, IOPORT_MODE_MUX_B},
    /* USART2 */
    {PIO_PA12_IDX, USART_2, IOPORT_MODE_MUX_A},
    /* USART3 */
    {PIO_PB9_IDX, USART_3, IOPORT_MODE_MUX_B},
    /* USART4 */
    {PIO_PB5_IDX, USART_4, IOPORT_MODE_MUX_B},
    {PIO_PB24_IDX, USART_4, IOPORT_MODE_MUX_B},
    /* USART5 */
    {PIO_PA24_IDX, USART_5, IOPORT_MODE_MUX_B},
    {PIO_PB20_IDX, USART_5, IOPORT_MODE_MUX_B},
    /* USART6 */
    {PIO_PA0_IDX, USART_6, IOPORT_MODE_MUX_A},
    {PIO_PA25_IDX, USART_6, IOPORT_MODE_MUX_B},
    {PIO_PC6_IDX, USART_6, IOPORT_MODE_MUX_B},
    /* USART7 */
    {PIO_PB4_IDX, USART_7, IOPORT_MODE_MUX_B},
    /* UART */
    {PIO_PD2_IDX, UART0, IOPORT_MODE_MUX_A},
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_UART_RX[] = {
    /* USART0 */
    {PIO_PA5_IDX, USART_0, IOPORT_MODE_MUX_A},
    /* USART1 */
    {PIO_PA9_IDX, USART_1, IOPORT_MODE_MUX_A},
    {PIO_PC3_IDX, USART_1, IOPORT_MODE_MUX_B},
    /* USART2 */
    {PIO_PA13_IDX, USART_2, IOPORT_MODE_MUX_A},
    /* USART3 */
    {PIO_PB10_IDX, USART_3, IOPORT_MODE_MUX_B},
    /* USART4 */
    {PIO_PB6_IDX, USART_4, IOPORT_MODE_MUX_B},
    {PIO_PB25_IDX, USART_4, IOPORT_MODE_MUX_B},
    /* USART5 */
    {PIO_PA23_IDX, USART_5, IOPORT_MODE_MUX_B},
    {PIO_PB21_IDX, USART_5, IOPORT_MODE_MUX_B},
    /* USART6 */
    {PIO_PA1_IDX, USART_6, IOPORT_MODE_MUX_A},
    {PIO_PA26_IDX, USART_6, IOPORT_MODE_MUX_B},
    {PIO_PC7_IDX, USART_6, IOPORT_MODE_MUX_B},
    /* USART7 */
    {PIO_PB3_IDX, USART_7, IOPORT_MODE_MUX_B},
    /* UART */
    {PIO_PD1_IDX, UART0, IOPORT_MODE_MUX_A},
    {NC, NC, 0}
};


MBED_WEAK const PinMap PinMap_UART_SCK[] = {
	/* USART0 */
    {PIO_PA6_IDX, USART_0, IOPORT_MODE_MUX_A},
    /* USART2 */
    {PIO_PA14_IDX, USART_2, IOPORT_MODE_MUX_A},
    /* USART3 */
    {PIO_PB11_IDX, USART_3, IOPORT_MODE_MUX_B},
    /* USART4 */
    {PIO_PB26_IDX, USART_4, IOPORT_MODE_MUX_B},
    /* USART5 */
    {PIO_PA22_IDX, USART_5, IOPORT_MODE_MUX_B},
    {PIO_PB22_IDX, USART_5, IOPORT_MODE_MUX_B},
    {PIO_PC7_IDX, USART_5, IOPORT_MODE_MUX_A},
    /* USART6 */
    {PIO_PA27_IDX, USART_6, IOPORT_MODE_MUX_B},
    {PIO_PC18_IDX, USART_6, IOPORT_MODE_MUX_A},
    /* USART7 */
    {PIO_PB2_IDX, USART_7, IOPORT_MODE_MUX_B},
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_UART_CTS[] = {
	/* USART0 */
    {PIO_PA7_IDX, USART_0, IOPORT_MODE_MUX_A},
    /* USART2 */
    {PIO_PA15_IDX, USART_2, IOPORT_MODE_MUX_A},
    /* USART3 */
    {PIO_PB12_IDX, USART_3, IOPORT_MODE_MUX_B},
    /* USART4 */
    {PIO_PC0_IDX, USART_4, IOPORT_MODE_MUX_B},
    /* USART5 */
    {PIO_PA21_IDX, USART_5, IOPORT_MODE_MUX_B},
    {PIO_PB23_IDX, USART_5, IOPORT_MODE_MUX_B},
    {PIO_PC6_IDX, USART_5, IOPORT_MODE_MUX_A},
    /* USART6 */
    {PIO_PA28_IDX, USART_6, IOPORT_MODE_MUX_B},
    {PIO_PC19_IDX, USART_6, IOPORT_MODE_MUX_A},
    /* USART7 */
    {PIO_PB1_IDX, USART_7, IOPORT_MODE_MUX_B},
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_UART_RTS[] = {
	/* USART0 */
    {PIO_PA6_IDX, USART_0, IOPORT_MODE_MUX_B},
    {PIO_PA29_IDX, USART_0, IOPORT_MODE_MUX_B},
    /* USART1 */
    {PIO_PA29_IDX, USART_2, IOPORT_MODE_MUX_C},
    /* USART2 */
    {PIO_PA14_IDX, USART_2, IOPORT_MODE_MUX_B},
    {PIO_PA29_IDX, USART_2, IOPORT_MODE_MUX_D},
    /* USART3 */
    {PIO_PB0_IDX, USART_3, IOPORT_MODE_MUX_B},
    {PIO_PB11_IDX, USART_3, IOPORT_MODE_MUX_C},
    /* USART4 */
    {PIO_PB26_IDX, USART_4, IOPORT_MODE_MUX_C},
    /* USART5 */
    {PIO_PA22_IDX, USART_5, IOPORT_MODE_MUX_C},
    {PIO_PB22_IDX, USART_5, IOPORT_MODE_MUX_C},
    {PIO_PC7_IDX, USART_5, IOPORT_MODE_MUX_C},
    /* USART6 */
    {PIO_PA27_IDX, USART_6, IOPORT_MODE_MUX_C},
    {PIO_PC18_IDX, USART_6, IOPORT_MODE_MUX_B},
    /* USART7 */
    {PIO_PB2_IDX, USART_7, IOPORT_MODE_MUX_C},
    {NC, NC, 0}
};

